Revit 2027 API
RebarBarType.Create Method
 Creates a new RebarBarType object
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarBarType Create(
	Document ADoc
)
Public Shared Function Create (
	ADoc As Document
) As RebarBarType
public:
static RebarBarType^ Create(
	Document^ ADoc
)
static member Create :
        ADoc : Document -> RebarBarType
Parameters
ADoc Document
Return Value
RebarBarType
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace